Masmiseim36/Kinetis/targets/Kinetis/CMSIS/MK70F12WS.h
/* CRC - Peripheral instance base addresses */
/** Peripheral CRC base address */
#define CRC_BASE                                 (0x40032000u)
/** Peripheral CRC base pointer */
#define CRC0                                     ((CRC_Type *)CRC_BASE)
/** Array initializer of CRC peripheral base pointers */
#define CRC_BASES                                { CRC0 }

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DAC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DAC_Peripheral_Access_Layer DAC Peripheral Access Layer
 * @{
 */

/** DAC - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x2 */
    __IO uint8_t DATL;                               /**< DAC Data Low Register, array offset: 0x0, array step: 0x2 */
    __IO uint8_t DATH;                               /**< DAC Data High Register, array offset: 0x1, array step: 0x2 */
  } DAT[16];
  __IO uint8_t SR;                                 /**< DAC Status Register, offset: 0x20 */
  __IO uint8_t C0;                                 /**< DAC Control Register, offset: 0x21 */
  __IO uint8_t C1;                                 /**< DAC Control Register 1, offset: 0x22 */
  __IO uint8_t C2;                                 /**< DAC Control Register 2, offset: 0x23 */
} DAC_Type;

/* ----------------------------------------------------------------------------
   -- DAC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DAC_Register_Masks DAC Register Masks
 * @{
 */

/* DATL Bit Fields */
#define DAC_DATL_DATA_MASK                       0xFFu
#define DAC_DATL_DATA_SHIFT                      0
#define DAC_DATL_DATA(x)                         (((uint8_t)(((uint8_t)(x))<<DAC_DATL_DATA_SHIFT))&DAC_DATL_DATA_MASK)
/* DATH Bit Fields */
#define DAC_DATH_DATA_MASK                       0xFu
#define DAC_DATH_DATA_SHIFT                      0
#define DAC_DATH_DATA(x)                         (((uint8_t)(((uint8_t)(x))<<DAC_DATH_DATA_SHIFT))&DAC_DATH_DATA_MASK)
/* SR Bit Fields */
#define DAC_SR_DACBFRPBF_MASK                    0x1u
#define DAC_SR_DACBFRPBF_SHIFT                   0
#define DAC_SR_DACBFRPTF_MASK                    0x2u
#define DAC_SR_DACBFRPTF_SHIFT                   1
#define DAC_SR_DACBFWMF_MASK                     0x4u
#define DAC_SR_DACBFWMF_SHIFT                    2
/* C0 Bit Fields */
#define DAC_C0_DACBBIEN_MASK                     0x1u
#define DAC_C0_DACBBIEN_SHIFT                    0
#define DAC_C0_DACBTIEN_MASK                     0x2u
#define DAC_C0_DACBTIEN_SHIFT                    1
#define DAC_C0_DACBWIEN_MASK                     0x4u
#define DAC_C0_DACBWIEN_SHIFT                    2
#define DAC_C0_LPEN_MASK                         0x8u
#define DAC_C0_LPEN_SHIFT                        3
#define DAC_C0_DACSWTRG_MASK                     0x10u
#define DAC_C0_DACSWTRG_SHIFT                    4
#define DAC_C0_DACTRGSEL_MASK                    0x20u
#define DAC_C0_DACTRGSEL_SHIFT                   5
#define DAC_C0_DACRFS_MASK                       0x40u
#define DAC_C0_DACRFS_SHIFT                      6
#define DAC_C0_DACEN_MASK                        0x80u
#define DAC_C0_DACEN_SHIFT                       7
/* C1 Bit Fields */
#define DAC_C1_DACBFEN_MASK                      0x1u
#define DAC_C1_DACBFEN_SHIFT                     0
#define DAC_C1_DACBFMD_MASK                      0x6u
#define DAC_C1_DACBFMD_SHIFT                     1
#define DAC_C1_DACBFMD(x)                        (((uint8_t)(((uint8_t)(x))<<DAC_C1_DACBFMD_SHIFT))&DAC_C1_DACBFMD_MASK)
#define DAC_C1_DACBFWM_MASK                      0x18u
#define DAC_C1_DACBFWM_SHIFT                     3
#define DAC_C1_DACBFWM(x)                        (((uint8_t)(((uint8_t)(x))<<DAC_C1_DACBFWM_SHIFT))&DAC_C1_DACBFWM_MASK)
#define DAC_C1_DMAEN_MASK                        0x80u
#define DAC_C1_DMAEN_SHIFT                       7
/* C2 Bit Fields */
#define DAC_C2_DACBFUP_MASK                      0xFu
#define DAC_C2_DACBFUP_SHIFT                     0
#define DAC_C2_DACBFUP(x)                        (((uint8_t)(((uint8_t)(x))<<DAC_C2_DACBFUP_SHIFT))&DAC_C2_DACBFUP_MASK)
#define DAC_C2_DACBFRP_MASK                      0xF0u
#define DAC_C2_DACBFRP_SHIFT                     4
#define DAC_C2_DACBFRP(x)                        (((uint8_t)(((uint8_t)(x))<<DAC_C2_DACBFRP_SHIFT))&DAC_C2_DACBFRP_MASK)

/*!
 * @}
 */ /* end of group DAC_Register_Masks */


/* DAC - Peripheral instance base addresses */
/** Peripheral DAC0 base address */
#define DAC0_BASE                                (0x400CC000u)
/** Peripheral DAC0 base pointer */
#define DAC0                                     ((DAC_Type *)DAC0_BASE)
/** Peripheral DAC1 base address */
#define DAC1_BASE                                (0x400CD000u)
/** Peripheral DAC1 base pointer */
#define DAC1                                     ((DAC_Type *)DAC1_BASE)
/** Array initializer of DAC peripheral base pointers */
#define DAC_BASES                                { DAC0, DAC1 }

/*!
 * @}
 */ /* end of group DAC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DDR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DDR_Peripheral_Access_Layer DDR Peripheral Access Layer
 * @{
 */

/** DDR - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR00;                              /**< DDR Control Register 0, offset: 0x0 */
  __I  uint32_t CR01;                              /**< DDR Control Register 1, offset: 0x4 */
  __IO uint32_t CR02;                              /**< DDR Control Register 2, offset: 0x8 */
  __IO uint32_t CR03;                              /**< DDR Control Register 3, offset: 0xC */
  __IO uint32_t CR04;                              /**< DDR Control Register 4, offset: 0x10 */
  __IO uint32_t CR05;                              /**< DDR Control Register 5, offset: 0x14 */
  __IO uint32_t CR06;                              /**< DDR Control Register 6, offset: 0x18 */
  __IO uint32_t CR07;                              /**< DDR Control Register 7, offset: 0x1C */
  __IO uint32_t CR08;                              /**< DDR Control Register 8, offset: 0x20 */
  __IO uint32_t CR09;                              /**< DDR Control Register 9, offset: 0x24 */
  __IO uint32_t CR10;                              /**< DDR Control Register 10, offset: 0x28 */
  __IO uint32_t CR11;                              /**< DDR Control Register 11, offset: 0x2C */
  __IO uint32_t CR12;                              /**< DDR Control Register 12, offset: 0x30 */
  __IO uint32_t CR13;                              /**< DDR Control Register 13, offset: 0x34 */
  __IO uint32_t CR14;                              /**< DDR Control Register 14, offset: 0x38 */
  __IO uint32_t CR15;                              /**< DDR Control Register 15, offset: 0x3C */
  __IO uint32_t CR16;                              /**< DDR Control Register 16, offset: 0x40 */
  __IO uint32_t CR17;                              /**< DDR Control Register 17, offset: 0x44 */
  __IO uint32_t CR18;                              /**< DDR Control Register 18, offset: 0x48 */
  __IO uint32_t CR19;                              /**< DDR Control Register 19, offset: 0x4C */
  __IO uint32_t CR20;                              /**< DDR Control Register 20, offset: 0x50 */
  __IO uint32_t CR21;                              /**< DDR Control Register 21, offset: 0x54 */
  __IO uint32_t CR22;                              /**< DDR Control Register 22, offset: 0x58 */
  __I  uint32_t CR23;                              /**< DDR Control Register 23, offset: 0x5C */
  __I  uint32_t CR24;                              /**< DDR Control Register 24, offset: 0x60 */
  __IO uint32_t CR25;                              /**< DDR Control Register 25, offset: 0x64 */
  __IO uint32_t CR26;                              /**< DDR Control Register 26, offset: 0x68 */
  __IO uint32_t CR27;                              /**< DDR Control Register 27, offset: 0x6C */
  __IO uint32_t CR28;                              /**< DDR Control Register 28, offset: 0x70 */
  __IO uint32_t CR29;                              /**< DDR Control Register 29, offset: 0x74 */
  __IO uint32_t CR30;                              /**< DDR Control Register 30, offset: 0x78 */
  __IO uint32_t CR31;                              /**< DDR Control Register 31, offset: 0x7C */
  __I  uint32_t CR32;                              /**< DDR Control Register 32, offset: 0x80 */
  __I  uint32_t CR33;                              /**< DDR Control Register 33, offset: 0x84 */
  __IO uint32_t CR34;                              /**< DDR Control Register 34, offset: 0x88 */
  __I  uint32_t CR35;                              /**< DDR Control Register 35, offset: 0x8C */
  __I  uint32_t CR36;                              /**< DDR Control Register 36, offset: 0x90 */
  __IO uint32_t CR37;                              /**< DDR Control Register 37, offset: 0x94 */
  __IO uint32_t CR38;                              /**< DDR Control Register 38, offset: 0x98 */
  __IO uint32_t CR39;                              /**< DDR Control Register 39, offset: 0x9C */
  __IO uint32_t CR40;                              /**< DDR Control Register 40, offset: 0xA0 */
  __IO uint32_t CR41;                              /**< DDR Control Register 41, offset: 0xA4 */
  __IO uint32_t CR42;                              /**< DDR Control Register 42, offset: 0xA8 */
  __IO uint32_t CR43;                              /**< DDR Control Register 43, offset: 0xAC */
  __IO uint32_t CR44;                              /**< DDR Control Register 44, offset: 0xB0 */
  __IO uint32_t CR45;                              /**< DDR Control Register 45, offset: 0xB4 */
  __IO uint32_t CR46;                              /**< DDR Control Register 46, offset: 0xB8 */
  __IO uint32_t CR47;                              /**< DDR Control Register 47, offset: 0xBC */
  __IO uint32_t CR48;                              /**< DDR Control Register 48, offset: 0xC0 */
  __IO uint32_t CR49;                              /**< DDR Control Register 49, offset: 0xC4 */
  __IO uint32_t CR50;                              /**< DDR Control Register 50, offset: 0xC8 */
  __IO uint32_t CR51;                              /**< DDR Control Register 51, offset: 0xCC */
  __IO uint32_t CR52;                              /**< DDR Control Register 52, offset: 0xD0 */
  __IO uint32_t CR53;                              /**< DDR Control Register 53, offset: 0xD4 */
  __IO uint32_t CR54;                              /**< DDR Control Register 54, offset: 0xD8 */
  __IO uint32_t CR55;                              /**< DDR Control Register 55, offset: 0xDC */
  __IO uint32_t CR56;                              /**< DDR Control Register 56, offset: 0xE0 */
  __IO uint32_t CR57;                              /**< DDR Control Register 57, offset: 0xE4 */
  __I  uint32_t CR58;                              /**< DDR Control Register 58, offset: 0xE8 */
  __I  uint32_t CR59;                              /**< DDR Control Register 59, offset: 0xEC */
  __I  uint32_t CR60;                              /**< DDR Control Register 60, offset: 0xF0 */
  __I  uint32_t CR61;                              /**< DDR Control Register 61, offset: 0xF4 */
  __I  uint32_t CR62;                              /**< DDR Control Register 62, offset: 0xF8 */
  __I  uint32_t CR63;                              /**< DDR Control Register 63, offset: 0xFC */
       uint8_t RESERVED_0[128];
  __IO uint32_t RCR;                               /**< RCR Control Register, offset: 0x180 */
       uint8_t RESERVED_1[40];
  __IO uint32_t PAD_CTRL;                          /**< I/O Pad Control Register, offset: 0x1AC */
} DDR_Type;

/* ----------------------------------------------------------------------------
   -- DDR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DDR_Register_Masks DDR Register Masks
 * @{
 */

